---
kind: type
id: T:Autodesk.Revit.DB.PrinterResolution
source: html/5d92da01-ee52-bab1-01fe-ac060a51a746.htm
---
# Autodesk.Revit.DB.PrinterResolution

Controls the resolution level in rendering settings.

## Syntax (C#)
```csharp
public enum PrinterResolution
```

## Remarks
It is applicable only when using printer resolution.
 The suitable resolution value for each resolution level is decided by default in Revit.